# Dispose Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilteredElementIterator..::..Dispose Method
FilteredElementIterator Class See Also
---
Releases all resources used by the FilteredElementIterator
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# See Also
FilteredElementIterator Class
Autodesk.Revit.DB Namespace